# =============================================================================
# Shell & Terminal
# =============================================================================

brew "fzf"
brew "htop"
brew "mise"
brew "starship"
brew "tmux"
brew "wget"

# =============================================================================
# File Search & Processing
# =============================================================================

brew "bfs"
brew "fd"
brew "hl"
brew "jq"

# =============================================================================
# Git
# =============================================================================

brew "gh"
brew "git"
brew "git-filter-repo"

# =============================================================================
# Programming Languages & Runtimes
# =============================================================================

brew "go"
brew "node"
brew "openjdk"

# =============================================================================
# Development Tools
# =============================================================================

brew "pre-commit"

# =============================================================================
# Containers & Kubernetes
# =============================================================================

brew "dive"
brew "docker"
brew "docker-buildx"
brew "docker-compose"
brew "helm"
brew "kubectx"
brew "kubernetes-cli"

# =============================================================================
# Cloud & Infrastructure
# =============================================================================

brew "awscli"

# =============================================================================
# Media & Recording
# =============================================================================

brew "agg"
brew "asciinema"

# =============================================================================
# Casks (macOS Applications)
# =============================================================================

cask "1password-cli"
cask "firefox"
cask "jetbrains-toolbox"
cask "raycast"
