# =============================================================================
# Taps
# =============================================================================

tap "goreleaser/tap"

# =============================================================================
# Shell & Terminal
# =============================================================================

brew "fzf"
brew "htop"
brew "mise"
brew "starship"
brew "tmux"
brew "tree"
brew "viddy"
brew "wget"

# =============================================================================
# File Search & Processing
# =============================================================================

brew "bfs"
brew "fd"
brew "hl"
brew "jq"
brew "ripgrep"

# =============================================================================
# Git
# =============================================================================

brew "gh"
brew "git"
brew "git-filter-repo"

# =============================================================================
# Programming Languages & Runtimes
# =============================================================================

brew "go"
brew "node"
brew "openjdk"

# =============================================================================
# Development Tools
# =============================================================================

brew "golangci-lint"
brew "goreleaser/tap/goreleaser"
brew "pdm"
brew "pre-commit"
brew "typescript"
brew "typescript-language-server"
brew "vale"

# =============================================================================
# Containers & Kubernetes
# =============================================================================

brew "colima"
brew "dive"
brew "docker"
brew "docker-buildx"
brew "docker-compose"
brew "helm"
brew "kubectx"
brew "kubernetes-cli"

# =============================================================================
# Cloud & Infrastructure
# =============================================================================

brew "awscli"
brew "opa"
brew "opentofu"
brew "saml2aws"
brew "terraform-docs"

# =============================================================================
# Documentation & Testing
# =============================================================================

brew "bats-core"
brew "mkdocs"

# =============================================================================
# Media & Recording
# =============================================================================

brew "agg"
brew "asciinema"
brew "ffmpeg"

# =============================================================================
# Casks (macOS Applications)
# =============================================================================

cask "1password-cli"
cask "firefox"
cask "gcloud-cli"
cask "jetbrains-toolbox"
cask "raycast"
cask "teleport"
